"""
Проверка условий:
напишите последовательность условий. Выведите описание каждой проверки и ваш прогноз
относительно ее результата. Код должен выглядеть примерно так:

car = 'subaru'
print("Is car == 'subaru'? I predict True.")
print(car == 'subaru')
print("\nIs car == 'audi'? I predict False.")
print(car == 'audi')

    Внимательно просмотрите результаты. Убедитесь в том, что вы понимаете,
    почему результат каждой строки равен True или False.

    Создайте как минимум 10 условий. Не менее пяти одних должны давать результат True,
    а не менее пяти других — результат False.
"""

video_card = 'GTX 3070'
print("Эта видеокарта  == 'GTX 3070'? Я прогнозирую что ДА")
print("car == 'GTX 3070'")

print("\nЭта видеокарта  == 'GTX 3070'? Я прогнозирую что НЕТ")
print("car == 'Radeon 570X'")