"""
Сложение:
при вводе числовых данных часто встречается типичная проблема: пользователь вводит текст вместо чисел.
При попытке преобразовать данные в int происходит исключение ValueError. Напишите программу, которая
запрашивает два числа, складывает их и выводит результат. Перехватите исключение ValueError,
если какое-либо из входных значений не является числом, и выведите удобное сообщение об ошибке.
Протестируйте свою программу: сначала введите два числа, а потом введите текст вместо одного из чисел.
"""
