"""
Число 8:
Напишите операции сложения, вычитания, умножения, и деления, результатом
которых является число 8. Не забудьте заключить операции в команды print(),
чтобы проверить результат. Вы должны написать четыре строки кода, которые
выглядат примерно так:
    print(5+3)
"""
print(5 + 3)
print(24 / 3)
print(2 * 4)
print(18 - 10)
