"""
Знаменитая цитата 2: повторите упражнение 2.5, но на этот раз сохраните имя автора цитаты в переменной
famous_person. Затем составьте сообщение и сохраните его в новой переменной с именем message.
Выведите свое сообщение.
"""
famous_person = 'Публий (Гай) Корнелий Тацит'
# Можно было составить сообщение с помощью двух переменных.
citate = '" Чем ближе государство (imperium) к падению, тем многочисленнее его законы"'
message = f'{famous_person} " Чем ближе государство (imperium) к падению, тем многочисленнее его законы"'
print(message)
