# Пользователь вводит данные и программа проверяет соответвуют они условию.
height = int(input("Какой у тебя рост: "))
if height >= 120:
    print("\nВы можете прокатится")
else:
    print("Вы очень маленькие для этого атракциона")
