"""
Прокат машин:
напишите программу, которая спраишвает у пользователя, какую машину он бы хотел взять напрокат.
Выведите сообщениe с введенными данными (например, "давай посмотрим, смогу ли я найти тебе Субару".
"""
question = input("Какую машину вы ищите? ")
print(f"\nДавай посмотрим, смогу ли я найти тебе автомобиль {question}")