"""
Любимые числа:
используйте словарь для хранения любимых чисел.
Возьмите пять имен и используйте их как ключи словаря. Придумайте любимое число
для каждого человека и сохраните его как значение в словаре.
Выведите имя каждого человека и его любимое число. Чтобы задача стала более интересной,
опросите несколько друзей и соберите реальные данные для своей программы.
"""

love_number = {
    'Ольга': 7,
    'Максим': 6,
    'Василий': 3,
    'Наталья': 1,
    'Олег': 9,
}

print(love_number['Ольга'])
print(love_number['Максим'])
print(love_number['Василий'])
print(love_number['Наталья'])
print(love_number['Олег'])
