"""
Человек:
используйте словарь для сохранения информации об известном человеке.
Сохраните имя, фамили, возраст и город, в котором живет это человек.
Словарь должен содержать ключи и с такими именами, first_name,
last_name, age и city. Выведите каждый фрагмент информации, хранящейся в словаре.
"""
people = {
    'first_name': 'Максим',
    'last_name': 'Золотухни',
    'age': 37,
    'city': 'Курск'
}

print(people['first_name'])
print(people['last_name'])
print(people['age'])
print(people['city'])

