"""
Список гостей:
если бы вы могли пригласитьт кого угодно на обед, то кого бы вы пригласили?
Создайте список, включающий миниму трех людей которых вам хотелось бы пригласить на обед.
Затем используйте это список для  вывода пригласительного сообщения каждому участнику.
"""
# Создаем список с именами гостей
name_list = ['Максим', 'Ольга', 'Мирослава', 'Демид']
# Приглашаем каждого человека на обеди из списка.
print(f'{name_list[0]} приглашаю тебя на обед')
print(f'{name_list[1]} приглашаю тебя на обед')
print(f'{name_list[2]} приглашаю тебя на обед')
print(f'{name_list[3]} приглашаю тебя на обед')
