"""
Имена:
сохраните имена нескольких своих друзей в списке с именем names.
Выведите имя каждого друга, обратившись к каждому элементу списка (по одному за раз).
"""
name_list = ['Женя', 'Андрей', 'Олег', 'Кирилл', 'Ольга']
print(name_list[0].title())
print(name_list[1].title())
print(name_list[2].title())
print(name_list[-2].title()) # Обращение ко второму с конца элементу
print(name_list[-1].title()) # Обращение к первеому с конца элементу
